/*
Дадена е редица от N цели положителни числа. Напишете програма, която
намира дължината на най-дългата подредица, сумата от елементите на която се
дели без остатък на дадено число K. Не е задължително подредицата да съдържа
последователни елементи от дадената редица. Подредицата може да бъде празна
(т.е. с дължина 0), както и може да съвпада с цялата редица.
Вход
Първият ред съдържа две числа N и K. Следват елементите на редицата.
Всички числа във входа (включително N и К) са цели положителни числа, по-малки от
1000.
Изход
Дължината на най-дългата намерена подредица с описаното свойство.

Вход:
7 5
1 2 1 2 2 1 4
Изход:
5 
*/

// IN PROGRESS

#include "task_16.h"

int main(void){

    int arr[] = {1, 2, 1, 2, 2, 1, 4};

    bubbleSort(arr, 7);

    LinkedList *newList = init();

    int sum = 0;
    for (int i = 0; i < 7; i++){
        insertLast(newList, arr[i]);
        sum += arr[i];
    }

    //display(newList);

    longestSeq(newList, 5, sum);

    return 0;
}

// 4 2 2 2 1 1 1 = 13 % 5 = 3 =>>> 13 - 3  //10