/*
Напишете програма, която при дадена редица изтрива всички числа, които
се срещат нечетен брой пъти. За целта използвайте функция.

Пример:
array = {4, 2, 2, 5, 2, 3, 2, 3, 1, 5, 2}
{5, 3, 3, 5}
*/

#include "task_14.h"

int main(void){

    int test_arr[][SIZE] = {
                        {4, 2, 2, 5, 2, 3, 2, 3, 1, 5, 2},
                        {4, 4, 1, 1, 3, 3, 6, 6, 7, 7, 2},
                        {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}
                     }; 

    for (int i = 0; i < 3; ++i){
            run(test_arr[i]);
        }    

    return 0;
}