/* Да се напише функция, която зависи от един двумерен масив и
броят на неговите редове и колони и транспонира този масив, като
транспонираният масив се връща кото стойност на функцията.*/

#include "task_20.h"

int main()
{

    int arr[ROW][COL] = {{3, 4, 5}, {6, 7, 8}, {9, 10, 11}, {12, 13, 14}};
    
    int **result = transposeArr((int*) arr);

    for (int i = 0; i < COL; i++){
        for (int j = 0; j < ROW; j++){
            printf("%d ", result[i][j]);
        }
        printf("\n");
    }
    
    return 0;
}