/* 11. Обичате да ядете бонбони, нали. Искате винаги да имате N бонбона в
себе си. Всеки час можете да си купите по един бонбон, да изядете по един
бонбон, който имате, или да удвоите всички бонбони. За колко най-малко
часа може да постигнете това?
Например:
Ако N е 1, отговорът би бил 0 (нищо за правене, вече имате 1).
Ако N е 2, отговорът би бил 1 (бихте могли или да купите нов бонбон, или да
удвоите тези, които имате).
Ако N е 7, отговорът би бил 4 (добавяте 1 в първия час, удвоявате двата
втория, удвоявате четирите третия и изяждате един през четвъртия час).
Ако N е 19, отговорът би бил 6: добавяте (стават 2), удвоявате (стават 4),
добавяте (стават 5), удвоявате (стават 10), удвоявате (стават 20), изяждате
(стават 19).

*/

#include "Queue_h.h"

Queue *front, *rear;

void exerciseSolver(int n, int m);

int main()
{
    init();
    int n = 7;
    int m = 1;
    exerciseSolver(m, n);
}

void exerciseSolver(int m, int n)
{
    int value = n;
    enQueue(n);

    int count = 0;

    (n == 1) ? (count = 0) : (count = -1);

    while (value > m)
    {
        value = deQueue();

        if (((value % 2) == 0) && ((value / 2) >= m))
        {
            enQueue(value / 2);
        }
        else if (((value - 1) != m) && ((value - 1) >= m))
        {
            enQueue(value - 1);
        }
        else
        {
            enQueue(value + 1);
        }

        count++;
        printf("%d ", value);
    }
    printf("\n%d", count);
}