/*
Моделиране на играта “Броеница”: N деца застават в кръг
и получават номера от 1 до N. Като се започне от дете 1, по
часовниковата стрелка се отброяват М деца. Дете с номер М излиза
от кръга, след което започва ново броене от следващото дете.
Продължава, докато остане само едно дете, чийто номер трябва да
се определи.
*/

#include "task_3.h"

int main(void){

    int children = 10;  // select children count
    int M = 2;          // select who dies

    LinkedList *newList = init();

    run(newList, children, M);    

    return 0;
}

