/******************************************************************************
Напишете функция, която по даден е масив от цели числа изчислява
процента на неговите елементи, които са положителни, които са отрицателни и
които са нула. Резултатът, който връща функцията да бъде масив от числа между 0
и 1, даващи пропорцията на всеки вид числа.
● Програмата чете масива от числа, извиква горната функция и отпечатва като резултат
процентите всеки на нов ред с 6 цифри след десетичната запетая.

*******************************************************************************/

#include "task_5.h"

int main(void)
{   
    
    int test[TESTCASE][LEN] =   {
        
                        {5, 2, -7, 0, 6, -9, 5, 0, 1,}, 
                        {7, -1, -7, 0, 3, 9, -5, 0, -1},
                        {0, 0, 0, 0, 0, 0, 0, 0, 0},
                        {-5, -2, -7, -1, -6, -9, -5, -8, -1},
                        {9, 2, 7, 4, 6, 4, 5, 0, 1}
                    };
    
    printf("positive\tnegative\tzero\n");
    for (int i = 0; i < TESTCASE; i++){
        double* result = percent(test[i]);
        display(result);
    }
    
    return 0;
}
