/*
Дадени са двe опашки от числа, подредени в нараства ред от началото
към края на опашката. Да се напише функция mergeQueues, която чрез
операциите InsertElem и DeleteElem построява нова опашка, която се състои
от всички елементи на дадените две опашки, подредени в нарастващ ред от
началото към края.
Пример: ако първата опашка съдържа 1, 3, 5, а втората опашка съдържа
числата 1, 2, 6, получената опашка трябва да съдържа числата 1, 1, 2, 3, 5, 6.
*/

#include"task_12.h"

int main(){
    
    int test_arr1[TESTCASE][LEN] = {

                {7, 8, 19, 26, 33, 41, 44, 57, 69, 73},
                {13, 33, 37, 40, 51, 67, 78, 80, 88, 93},
                {1, 18, 23, 25, 47, 50, 66, 70, 81, 99}

            };

    int test_arr2[TESTCASE][LEN] = {

                {4, 17, 19, 33, 53, 79, 81, 85, 88, 93},
                {13, 33, 41, 59, 63, 67, 77, 81, 83, 91},
                {7, 27, 29, 46, 51, 66, 82, 91, 97, 98}

            };
    
    for(int i = 0; i < TESTCASE; i++){
        action(test_arr1[i], test_arr2[i]);
    }
    
    return 0;
}