/*Реализирайте стек, поддържащ операцията намиране на
максимална сума сред елементите на стека.
 Напишете програма, четяща имена в стек и отпечатайте
името при което се достигат 200 символа на имената, които
са в стека. Тук на всяко име ще се съпоставя дължината му,
т.е. брой символи в него. Понеже при долавяне на имена
броят на символите ще се увеличава, то операцията max за
такъв стек ще върне броят на символите в стека.*/

#include "task_17.h"

int main()
{   
    stack *stack1 = stackInit();

    fillStackGetLengthPrint(stack1);
    
    return 0;
}